---
type: CreateRelatedFileProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# CreateRelatedFileProgressChangedEventArgs

`Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CreatingCloudSharedLocal | 2018 | `public bool CreatingCloudSharedLocal { get ; }` |
| Property | DownloadFinished | 2018 | `public bool DownloadFinished { get ; }` |
| Property | FullDownload | 2018 | `public bool FullDownload { get ; }` |